		WITH
		SPRVER AS (
			SELECT REESUS_VER, USVMP_VER, SPRLPU_VER, PROFOT_VER, SPRNCO_VER, REESMS_VER
			FROM PMP_PROD.MV_DICT_VERSIONS
			WHERE PERIOD = :period
		)
		, REESUS AS (
			SELECT /*+ materialize */ TO_NUMBER(CODE) AS COD, TPN, NAME
			FROM SPRVER, PMP_NSI_NEW.NSI_MEDICAL_REGISTRY_SER
			WHERE VERSION_ID = SPRVER.REESUS_VER
		)
		, USVMP2 AS (
			SELECT /*+ materialize */ TO_NUMBER(CODE) COD, VMP
			FROM SPRVER, PMP_NSI_NEW.NSI_SPECIALIZED_MED_SERVICE
			WHERE VERSION_ID = SPRVER.USVMP_VER AND VMP146 IS NOT NULL AND VMP146 = 2 AND VMP IN (11, 13)-- стоматология
		)
		, USVMPNOT2 AS (
			SELECT /*+ materialize */ TO_NUMBER(CODE) COD
			FROM SPRVER, PMP_NSI_NEW.NSI_SPECIALIZED_MED_SERVICE
			WHERE VERSION_ID = SPRVER.USVMP_VER AND NOT (VMP146 IS NOT NULL AND VMP146 = 2 AND VMP IN (11, 13)) -- НЕ стоматология
		)
		, SPRLPU AS (
			SELECT /*+ materialize */ FIL_ID, CODE, TPN, TPNS, TO_DATE(START_DATE, 'YYYYMMDD') START_DATE, TO_DATE(END_DATE, 'YYYYMMDD') END_DATE, VMP
			FROM SPRVER, PMP_NSI_NEW.NSI_MOSCOW_OMS_DEPARTMENT
			WHERE VERSION_ID = SPRVER.SPRLPU_VER
		)
		, PROFOT AS (
			SELECT /*+ materialize */ CODE, USL_OK
			FROM SPRVER, PMP_NSI_NEW.NSI_BED_PROFILE_DEPARTMENT
			WHERE VERSION_ID = SPRVER.PROFOT_VER
		)
		, SPRNCO AS (
			SELECT /*+ materialize */ CODE,
				-- TO_DATE(DATE_B, 'YYYYMMDD') AS DATE_B,
				DIAG, IG,
				TO_DATE(DATEBEG_3, 'YYYYMMDD') AS DATEBEG_3,
				TO_DATE(DATEEND_3, 'YYYYMMDD') AS DATEEND_3,
				TO_DATE(DATEBEG_4, 'YYYYMMDD') AS DATEBEG_4,
				TO_DATE(DATEEND_4, 'YYYYMMDD') AS DATEEND_4
			FROM SPRVER, PMP_NSI_NEW.NSI_SPRNCOV
			WHERE VERSION_ID = SPRVER.SPRNCO_VER
		)
		, REESMS AS (
			SELECT TO_NUMBER(CODE) AS COD
			FROM SPRVER, PMP_NSI_NEW.NSI_MED_STANDARDS
			WHERE VERSION_ID = SPRVER.REESMS_VER
		)
		, P_S AS (
			SELECT P_S.PARCEL_ID, P_S.ID, P_S.INVOICE_ID, P_S.LPU_ID, P_S.PERIOD, P_S.COD, P_S.SN_POL, P_S.LPU_ORD, P_S.DATE_ORD, P_S.ORD, P_S.FIL_ID, P_S.P_CEL, P_S.CASE_ID, P_S.CASE_TYPE, P_S.IOTD, P_S.D_U, P_S.DS, P_S.NOVOR, P_S.D_TYPE, SPRLPU_ORD.TPN TPN_ORD
				, SUM(CASE WHEN REESMS.COD IS NOT NULL OR SUBSTR(LPAD(P_S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY P_S.SN_POL, NVL(P_S.NOVOR, -1), P_S.C_I) CNT_MS
			FROM PMP_PARCEL_S P_S
			LEFT JOIN REESMS ON
				P_S.COD = REESMS.COD
			LEFT JOIN SPRLPU SPRLPU_ORD ON SUBSTR(P_S.LPU_ORD, -4, 4) = SPRLPU_ORD.FIL_ID
			WHERE
				P_S.PARCEL_ID = :parcelId AND P_S.LPU_ID = :lpuId AND P_S.PERIOD = :period
				AND
				P_S.PARCEL_ID IN (
					SELECT ID
					FROM PMP_PARCEL pp
					WHERE ID = :parcelId AND LPU_ID = :lpuId AND PERIOD = :period AND "TYPE" = 'REPORT_TO_SMO'
				)
		)
		, P_R AS (
			SELECT PARCEL_ID, LPU_ID, PERIOD, SN_POL, /*PRIK_BEGIN_PERIOD*/ PRIK, /*PRIKS_BEGIN_PERIOD*/ PRIKS --, PRIK_BEGIN_PERIOD, PRIKS_BEGIN_PERIOD
			FROM PMP_PARCEL_R
			WHERE PARCEL_ID = :parcelId AND LPU_ID = :lpuId AND PERIOD = :period
		)
		, PS AS (
			SELECT /*+ index(S PMP_PARCEL_S_SNPOL_N) index(R PMP_PARCEL_ID_SN_POL) use_hash(S R pp) */ S.PARCEL_ID, S.ID, S.INVOICE_ID, S.LPU_ID, S.PERIOD, S.COD, S.SN_POL, S.C_I, S.ORD, S.DS, S.IOTD, S.CASE_ID, S.D_U, REESUS.TPN REESUS_TPN, R.PRIK, SPRLPU_ORD.TPN TPN_ORD, S.D_TYPE
				, SUM(S.K_U) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), SUBSTR(S.DS, 1, 3), S.COD, SUBSTR(S.IOTD, 2, 2) ORDER BY S.D_U, S.RECID) CNT_PRV
				, SUM(CASE WHEN REESUS.COD IS NULL OR SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) CNT_MS
			FROM PMP_PARCEL_S S
			INNER JOIN PMP_PARCEL_R R ON
				R.PARCEL_ID = :parcelId AND R.LPU_ID = :lpuId AND R.PERIOD = :period
				AND
				S.SN_POL = R.SN_POL
				AND
				R.PATIENT_TYPE = 0
			INNER JOIN USVMPNOT2 ON S.COD = USVMPNOT2.COD
			LEFT JOIN REESUS ON REESUS.COD = S.COD
			LEFT JOIN SPRLPU ON R.PRIK = SPRLPU.FIL_ID
			LEFT JOIN SPRLPU SPRLPU2 ON S.LPU_ID = SPRLPU2.FIL_ID
			LEFT JOIN SPRLPU SPRLPU_ORD ON S.LPU_ORD = SPRLPU_ORD.FIL_ID
			WHERE
				S.PARCEL_ID = :parcelId AND S.LPU_ID = :lpuId AND S.PERIOD = :period
				AND
				-- Только для счетов застрахованных в Москве пациентов, не прикреплённых к амбулаторным МО по профилю ?терапия?/?педиатрия?.
				(
					R.PRIK IS NULL
					OR
					R.PRIK = 0
					OR
					SPRLPU.TPN IS NULL
					OR
					SPRLPU.TPN NOT IN (1, 2, 3)
					OR
					S.NOVOR IS NOT NULL
				)
				AND
				S.PARCEL_ID IN (
					SELECT /*+ index(pp PK_PMP_PARCEL) */ ID
					FROM PMP_PARCEL pp
					WHERE ID = :parcelId AND LPU_ID = :lpuId AND PERIOD = :period AND "TYPE" = 'REPORT_TO_SMO'
				)
				AND
				SPRLPU2.TPN IS NOT NULL
		)
		, P_S_PF AS (
			SELECT S.PARCEL_ID, S.ID, S.INVOICE_ID, S.LPU_ID, S.PERIOD, S.COD, S.SN_POL, S.C_I, S.LPU_ORD, S.DATE_ORD, S.ORD, S.FIL_ID, S.IOTD
			FROM PMP_PARCEL_S S
			JOIN USVMP2 ON
				S.COD = USVMP2.COD
		--	JOIN REESUS ON
		--		S.COD = REESUS.COD
		--	JOIN PROFOT ON
		--		SUBSTR(S.IOTD, 2, 2) = PROFOT.CODE
		--		AND
		--		PROFOT.USL_OK = 3
			WHERE
				PARCEL_ID = :parcelId AND LPU_ID = :lpuId AND PERIOD = :period
				AND
				-- общие исключения 1
				SUBSTR(IOTD, 2, 2) NOT IN ('70', '73')
		)
		, P_R_PF AS (
			SELECT /*+index (R I_PMP_PARCEL_SNPOL)*/ PARCEL_ID, LPU_ID, PERIOD, SN_POL, PRIKS
			FROM PMP_PARCEL_R R
			WHERE
				PARCEL_ID = :parcelId AND LPU_ID = :lpuId AND PERIOD = :period
				AND
				R.PATIENT_TYPE != 1
		)
        , PH AS (
            SELECT -- ЗЛ
                'PH' ERROR_CODE
                , PS.PARCEL_ID
                , PS.ID PARCEL_S_ID
                , PS.INVOICE_ID
            FROM PS
            WHERE
				-- 1
				SUBSTR(PS.IOTD, 2, 2) IN ('00', '22', '24', '90', '80', '81', '92', '91')
				AND
				PS.REESUS_TPN IN ('p', 'q')
				AND
				-- исключения к 1
				NOT (
					-- исключение 1
					(
						PS.COD IN (1001, 1011, 1013, 1021, 1031, 1041, 1043, 1051, 1053, 1061, 1071, 1073, 1081, 1083, 1091, 1093, 1101, 1111, 1113, 1141, 1143, 1151, 1153, 1161
							, 1163, 1191, 1193, 1201, 1261, 1263, 1271, 1273, 1276, 1301, 1303, 1331, 1333, 1371, 1373, 1411, 1431, 1433, 1441, 1443, 1461, 1511, 1513, 1561, 1781
							, 1801, 1803, 1808, 1810, 1815, 1823, 1825, 1829, 1830, 9401, 9403, 9405, 56001, 56004, 56009, 56011, 56012, 56013, 56025, 56026, 56029, 56030, 56031
							, 101001, 101005, 101011, 101013, 101029, 101032, 101034, 101041, 101051, 101053, 101059, 101061, 101063, 101070, 101073, 101081, 101083, 101091, 101093
							, 101101, 101103, 101111, 101113, 101121, 101130, 101131, 101133, 101161, 101163, 101168, 101171, 101181, 101183, 101201, 101203, 101211, 101213, 101230
							, 101240, 101503, 101523, 101533, 101781, 109401, 109403, 109406, 109408, 109410, 109411, 156002, 156003)
						AND
						PS.CNT_PRV = 1
					)
					OR
					-- исключение 2 к 1
					SUBSTR(PS.IOTD, 2, 2) IN ('01', '85', '08', '70', '73', '93')
					OR
					PS.D_TYPE = 'w'
					OR
					-- исключения 3, 4 к 1
					PS.CNT_MS != 0
					OR
					-- исключение 4 к 1
					SUBSTR(LPAD(PS.COD, 6, '0'), 1, 3) IN ('099', '199')
					OR
					-- исключение 5 к 1
					--REESUS.TPN IN ('r')
					-- OR
					-- исключение 6 к 1
					(
						PS.COD IN (37043, 37048, 137043, 37044, 37049, 137044, 137049)
						AND
						EXISTS (
							SELECT 1
							FROM PMP_MEDICAL_CASE PMC
							WHERE
								PMC.ID = PS.CASE_ID
								AND
								PMC.DIRECTION_DOCTOR_SPEC IN (17, 41, 73, 82)
						)
					)
					OR
					-- исключение 7 к 1
					(
						PS.COD IN (37043, 137043)
						AND
						(
							SUBSTR(PS.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
							OR
							PS.DS IN ('B34.2', 'U07.1', 'U07.2')
						)
					)
					OR
					-- исключение 8 к 1
					(
						PS.COD IN (28165, 128165)
						AND
						EXISTS (
							SELECT *
							FROM SPRNCO
							WHERE
								CODE = PS.LPU_ID
								AND
								IG = 1
								AND
								TRUNC(PS.D_U) BETWEEN DATEBEG_4 AND DATEEND_4
						)
						AND
						PS.TPN_ORD IS NOT NULL
						AND
						PS.TPN_ORD IN (1, 2, 3)
					)
					OR
					-- исключение 9 к 1
					PS.ORD IN (7)
				)
        )
        , PG AS (
            SELECT
                'PG' ERROR_CODE
                , P_S.PARCEL_ID
                , P_S.ID PARCEL_S_ID
                , P_S.INVOICE_ID
            FROM P_S
            JOIN P_R ON
                P_R.SN_POL = P_S.SN_POL -- ЗЛ
            LEFT JOIN USVMP2 ON
                P_S.COD = USVMP2.COD
            LEFT JOIN PROFOT ON
                SUBSTR(P_S.IOTD, 2, 2) = PROFOT.CODE
            LEFT JOIN REESUS ON
                REESUS.COD = P_S.COD
            WHERE
				P_S.NOVOR IS NULL
				AND
				USVMP2.COD IS NULL
				AND
				P_S.LPU_ID IN (SELECT CODE FROM SPRLPU WHERE TPN IN (1, 2, 3, 4))
				AND
				P_S.LPU_ID NOT IN (SELECT CODE FROM SPRLPU WHERE FIL_ID = P_R.PRIK)
				AND
				P_R.PRIK IN (SELECT FIL_ID FROM SPRLPU WHERE TPN IN (1, 2, 3))
				AND
				REESUS.TPN IN ('p', 'q')
				AND
				SUBSTR(P_S.IOTD, 2, 2) IN ('00', '22', '24', '90', '80', '81', '92', '91')
				AND
				(
					-- 1
					(
						REESUS.TPN != 'q'
						AND
						NOT (
							P_S.ORD IS NOT NULL
							AND
							P_S.DATE_ORD IS NOT NULL
							AND
							P_S.LPU_ORD IS NOT NULL
							AND
							-- примечание 2 к 1
							NOT (
								(
									(
										LENGTH(P_S.LPU_ORD) = 4
										OR
										(
											LENGTH(P_S.LPU_ORD) = 6
											AND
											SUBSTR(P_S.LPU_ORD, 1, 2) = '77'
										)
									)
									AND
									SUBSTR(P_S.LPU_ORD, -4, 4) = P_S.LPU_ID
									AND
									P_S.LPU_ID IN (SELECT FIL_ID FROM SPRLPU WHERE TPN IS NOT NULL)
								)
								OR
								(
									LENGTH(P_S.LPU_ORD) = 6
									AND
									SUBSTR(P_S.LPU_ORD, 1, 2) != '77'
								)
							)
						)
						AND
						NOT (
							-- исключение 1, 10, 11 к 1
							SUBSTR(P_S.IOTD, 2, 2) IN ('01', '85', '08', '70', '73', '93', '91', '92')
							OR
							P_S.D_TYPE = 'w'
							OR
							-- исключения 2, 3 к 1
							P_S.CNT_MS != 0
							OR
							-- исключение 3 к 1
							SUBSTR(LPAD(P_S.COD, 6, '0'), 1, 3) IN ('099', '199')
							OR
							-- исключение 4 к 1
							--REESUS.TPN IN ('r')
							-- OR
							-- исключение 5 к 1
							(
								P_S.COD IN (37043, 37048, 137043, 37044, 37049, 137044, 137049)
								AND
								EXISTS (
									SELECT 1
									FROM PMP_MEDICAL_CASE PMC
									WHERE
										PMC.ID = P_S.CASE_ID
										AND
										PMC.DIRECTION_DOCTOR_SPEC IN (17, 41, 73, 82)
								)
							)
							OR
							-- исключение 6 к 1
							(
								P_S.COD IN (37043, 137043)
								AND
								(
									SUBSTR(P_S.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
									OR
									P_S.DS IN ('B34.2', 'U07.1', 'U07.2')
								)
							)
							OR
							-- исключение 7 к 1
							(
								P_S.COD IN (28165, 128165)
								AND
								EXISTS (
									SELECT *
									FROM SPRNCO
									WHERE
										CODE = P_S.LPU_ID
										AND
										IG = 1
										AND
										TRUNC(P_S.D_U) BETWEEN DATEBEG_4 AND DATEEND_4
								)
								AND
								P_S.TPN_ORD IS NOT NULL
								AND
								P_S.TPN_ORD IN (1, 2, 3)
							)
							OR
							-- исключение 8, 9, 12 к 1
							P_S.ORD IN (7, 8, 6)
						)
					)
					OR
					-- 2
					(
						REESUS.TPN = 'q'
						AND
						NOT (
							P_S.ORD IS NOT NULL
							AND
							P_S.DATE_ORD IS NOT NULL
							AND
							P_S.LPU_ORD IS NOT NULL
						)
						AND
						P_S.P_CEL != '1.1'
						AND
						-- примечание 1 к 2
						NOT (
							-- исключение 1, 10, 11 к 1
							SUBSTR(P_S.IOTD, 2, 2) IN ('01', '85', '08', '70', '73', '93', '91', '92')
							OR
							P_S.D_TYPE = 'w'
							OR
							-- исключения 2, 3 к 1
							P_S.CNT_MS != 0
							OR
							-- исключение 3 к 1
							SUBSTR(LPAD(P_S.COD, 6, '0'), 1, 3) IN ('099', '199')
							OR
							-- исключение 4 к 1
							--REESUS.TPN IN ('r')
							-- OR
							-- исключение 5 к 1
							(
								P_S.COD IN (37043, 37048, 137043, 37044, 37049, 137044, 137049)
								AND
								EXISTS (
									SELECT 1
									FROM PMP_MEDICAL_CASE PMC
									WHERE
										PMC.ID = P_S.CASE_ID
										AND
										PMC.DIRECTION_DOCTOR_SPEC IN (17, 41, 73, 82)
								)
							)
							OR
							-- исключение 6 к 1
							(
								P_S.COD IN (37043, 137043)
								AND
								(
									SUBSTR(P_S.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
									OR
									P_S.DS IN ('B34.2', 'U07.1', 'U07.2')
								)
							)
							OR
							-- исключение 8, 9 к 1
							P_S.ORD IN (7, 8)
							OR
							-- исключение 2 к 2
							LOWER(REESUS.NAME) LIKE '%патронаж%'
						)
					)
					OR
					-- 3
					(
						P_S.LPU_ID IN (1872, 2290)
						AND
						SUBSTR(LPAD(P_S.COD, 6, '0'), 1, 3) IN ('025', '125', '026', '126', '027', '127', '028', '128', '029', '129', '030', '130')
						AND
						SUBSTR(P_S.IOTD, 2, 2) NOT IN ('00')
						AND
						NOT (
							-- исключение 1 к 3
							(
								SUBSTR(LPAD(P_S.COD, 6, '0'), 1, 3) IN ('029', '129')
								AND
								SUBSTR(P_S.IOTD, 2, 2) IN ('85')
							)
							OR
							-- исключение 2 к 3
							(
								P_R.PRIK = 0
								AND
								SUBSTR(P_S.IOTD, 2, 2) IN ('01', '90')
							)
							OR
							-- исключение 3 к 3
							(
								SUBSTR(P_S.IOTD, 2, 2) IN ('70', '73')
							)
							OR
							-- исключение 4 к 3
							(
								P_S.LPU_ID = 2290
								AND
								P_S.LPU_ORD IN ('2290', '772290')
							)
						)
					)
				)
        )
		, PF AS (
			SELECT
				'PF' ERROR_CODE
				, P_S.PARCEL_ID
				, P_S.ID PARCEL_S_ID
				, P_S.INVOICE_ID
			FROM P_S_PF P_S
			JOIN P_R_PF P_R ON
				P_R.SN_POL = P_S.SN_POL
			WHERE
				-- 1
				(
					P_R.PRIKS IS NOT NULL
					AND
					P_R.PRIKS != 0
					AND
					P_R.PRIKS != P_S.LPU_ID -- услуги стоматологии не по прикреплению
					AND
					P_R.PRIKS IN (SELECT FIL_ID FROM SPRLPU WHERE TPNS IN (1, 2, 3))
					AND
					NOT (
						-- исключение 1 к 1
						(
							P_S.LPU_ID IN (2321, 4733, 4734, 4996, 4698)
							AND
							SUBSTR(P_S.IOTD, 2, 2) IN ('01')
						)
						OR
						-- исключение 2 к 1 по задаче 10888
						(
							P_S.LPU_ID IN (2321, 4733, 4734, 4996, 4698)
							AND
							P_S.ORD = 7
							AND
							P_S.LPU_ORD = 7665
							AND
							P_S.C_I LIKE 'УМО%'
						)
					)
				)
				OR
				-- 2
				(
					(
						P_R.PRIKS IS NULL
						OR
						P_R.PRIKS = 0
						OR
						P_R.PRIKS NOT IN (SELECT FIL_ID FROM SPRLPU WHERE TPNS IN (1, 2, 3))
					)
					AND
					NOT (
						-- за исключением первичного приёма врача специалиста (в том числе, на дому)
						P_S.COD IN (9401, 9403, 109401, 109406, 109408
							, 9405, 109403, 109411)
						OR
						-- исключение 1 к 2
						(
							P_S.LPU_ID IN (2321, 4733, 4734, 4996, 4698)
							AND
							P_S.ORD = 7
							AND
							P_S.LPU_ORD = 7665
							AND
							P_S.C_I LIKE 'УМО%'
						)
						OR
						-- исключение 2 к 2
						(
							P_S.LPU_ID IN (2321, 4733, 4734, 4996, 4698)
							AND
							SUBSTR(P_S.IOTD, 2, 2) IN ('01')
						)
					)
				)
			UNION ALL
			SELECT
				'PF' ERROR_CODE
				, P_S.PARCEL_ID
				, P_S.ID PARCEL_S_ID
				, P_S.INVOICE_ID
			FROM PMP_PARCEL_S P_S
			WHERE P_S.PARCEL_ID = :parcelId AND P_S.LPU_ID = 5350 AND P_S.PERIOD = DATE'2021-01-01'
		)
        , FLK_PG_PH AS (
        	SELECT /*+ materialize */ *
        	FROM (
		        SELECT INVOICE_ID FROM PG
		        UNION ALL
		        SELECT INVOICE_ID FROM PH
		        UNION ALL
		        SELECT INVOICE_ID FROM PF
		    )
        ),
        t as(
		SELECT
			S.PARCEL_ID
			, S.LPU_ID
			, S.PERIOD
			, S.RECID
			, CASE
				WHEN
					(
						SPRLPU_LPU.TPN IN (1, 2, 3, 4)
						OR
						SPRLPU_LPU.TPNS IN (1, 2, 3, 4)
						OR
						SPRLPU_LPU.TPNS IS NULL
					)
					AND
					EXISTS (
						SELECT 1
						FROM FLK_PG_PH FLK_S
						WHERE
							FLK_S.INVOICE_ID = S.INVOICE_ID
					)
				THEN 'up'
				-- 2.5. Правила расчёта значения параметра F_TYPE.
				WHEN
					-- 1.  ГБУ города Москвы «ССиНМП им. А.С. Пучкова ДЗМ»:
                    -- 1.1. Все вызовы маркируются F_TYPE = «fp»;
					-- 2. ГБУЗ «МНПЦ ДиК ДЗМ»:
					-- 2.1 «ft» не используется;
					-- 3. ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ»:
					-- 3.1 «ft» используется в соответствии с общими правилами;
					S.LPU_ID NOT IN (4708, 4963)
					AND
					-- Значением «ft» маркируются следующие медицинские услуги:
					(
						-- 1.	В случае оказания ПСМП по профилю «терапия»/«педиатрия»:
						(
							-- 1.1)	медицинские услуги из справочника НСИ «pervprXX», оказанные неприкреплённым к медицинским организациям пациентам в поликлиническом кабинете или дневном стационаре (2-3 символы фасетного кода отделения «00» / «22» / «24» / «90» / «80» / «81» / «92» / «91») МО, имеющих значение TPN = 1/2/3/4.
							-- Примечание: иные медицинские услуги (имеющие признак TPN = p/q), равно как и перечисленные услуги, оказанные более одного раза для одной нозологии (рубрики МКБ 10 с точностью до маски ХХХ), оплате не подлежат.
							(
								(
									USVMP2.COD IS NULL
									AND
									(
										SPRLPU_PRIK.CODE IS NULL
										OR
										SPRLPU_PRIK.CODE = 4388
										OR
										S.NOVOR IS NOT NULL
									)
									AND
									SPRLPU_LPU.TPN IN (1, 2, 3, 4)
								)
							)
							AND
							SUM(
								CASE
									WHEN
										S.COD IN (1001, 1011, 1013, 1021, 1031, 1041, 1043, 1051, 1053, 1061, 1071, 1073, 1081, 1083, 1091, 1093, 1101, 1111, 1113, 1141, 1143, 1151, 1153, 1161
											, 1163, 1191, 1193, 1201, 1261, 1263, 1271, 1273, 1276, 1301, 1303, 1331, 1333, 1371, 1373, 1411, 1431, 1433, 1441, 1443, 1461, 1511, 1513, 1561, 1781
											, 1801, 1803, 1808, 1810, 1815, 1823, 1825, 1829, 1830, 9401, 9403, 9405, 56001, 56004, 56009, 56011, 56012, 56013, 56025, 56026, 56029, 56030, 56031
											, 101001, 101005, 101011, 101013, 101029, 101032, 101034, 101041, 101051, 101053, 101059, 101061, 101063, 101070, 101073, 101081, 101083, 101091, 101093
											, 101101, 101103, 101111, 101113, 101121, 101130, 101131, 101133, 101161, 101163, 101168, 101171, 101181, 101183, 101201, 101203, 101211, 101213, 101230
											, 101240, 101503, 101523, 101533, 101781, 109401, 109403, 109406, 109408, 109410, 109411, 156002, 156003)
										AND
										SUBSTR(S.IOTD, 2, 2) IN ('00', '22', '24', '90', '80', '81', '92', '91')
									THEN S.K_U
								END
							) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), SUBSTR(S.DS, 1, 3), S.COD ORDER BY S.D_U, S.RECID) = 1
							AND
							SUBSTR(S.IOTD, 2, 2) IN ('00', '22', '24', '90', '80', '81', '92', '91')
							AND
							REESUS.TPN IN ('p', 'q')
						)
						OR
						(
							-- 1.2)	медицинские услуги (имеющие значение TPN = p/q), оказанные неприкреплённым к медицинским организациям пациентам в поликлиническом кабинете или дневном стационаре (2-3 символы фасетного кода отделения «00» / «22» / «24» / «90» / «80» / «81» / «92» / «91») МО, имеющих значение TPN = «пусто».
							(
								(
									USVMP2.COD IS NULL
									AND
									(
										SPRLPU_PRIK.CODE IS NULL
										OR
										SPRLPU_PRIK.CODE = 4388
										OR
										S.NOVOR IS NOT NULL
									)
									AND
									SPRLPU_LPU.TPN IS NULL
								)
							)
							AND
							SUBSTR(S.IOTD, 2, 2) IN ('00', '22', '24', '90', '80', '81', '92', '91')
							AND
							REESUS.TPN IN ('p', 'q')
						)
						OR
						-- 2.	В случае оказания ПСМП по профилю «стоматология»:
						(
							-- 2.1)	стоматологические услуги (имеющие по справочнику НСИ USVMP сочетание VMP = 11/13 И VMP146 = 2) из справочника НСИ «pervprXX», оказанные пациентам, не прикреплённым к другим МО, в поликлиническом кабинете (2-3 символы фасетного кода отделения «00» / «22» / «24» / «90») МО, имеющих значение TPNS = 1/2/3.
							(
								(
									USVMP2.COD IS NOT NULL
									AND
									(
										SPRLPU_PRIKS.CODE IS NULL
										OR
										S.NOVOR IS NOT NULL
									)
									AND
									SPRLPU_LPU.TPNS IN (1, 2, 3)
								)
							)
							AND
							-- SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('009', '109')
							-- AND
							USVMP2.COD IS NOT NULL -- то же что и VMP146 = 2
							AND
							USVMP2.VMP IN (11, 13)
							AND
							SUM(
								CASE
									WHEN
										S.COD IN (1001, 1011, 1013, 1021, 1031, 1041, 1043, 1051, 1053, 1061, 1071, 1073, 1081, 1083, 1091, 1093, 1101, 1111, 1113, 1141, 1143, 1151, 1153, 1161
											, 1163, 1191, 1193, 1201, 1261, 1263, 1271, 1273, 1276, 1301, 1303, 1331, 1333, 1371, 1373, 1411, 1431, 1433, 1441, 1443, 1461, 1511, 1513, 1561, 1781
											, 1801, 1803, 1808, 1810, 1815, 1823, 1825, 1829, 1830, 9401, 9403, 9405, 56001, 56004, 56009, 56011, 56012, 56013, 56025, 56026, 56029, 56030, 56031
											, 101001, 101005, 101011, 101013, 101029, 101032, 101034, 101041, 101051, 101053, 101059, 101061, 101063, 101070, 101073, 101081, 101083, 101091, 101093
											, 101101, 101103, 101111, 101113, 101121, 101130, 101131, 101133, 101161, 101163, 101168, 101171, 101181, 101183, 101201, 101203, 101211, 101213, 101230
											, 101240, 101503, 101523, 101533, 101781, 109401, 109403, 109406, 109408, 109410, 109411, 156002, 156003)
										AND
										SUBSTR(S.IOTD, 2, 2) IN ('00', '22', '24', '90')
									THEN S.K_U
								END
							) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), SUBSTR(S.DS, 1, 3), S.COD ORDER BY S.D_U, S.RECID) = 1
							AND
							SUBSTR(S.IOTD, 2, 2) IN ('00', '22', '24', '90')
							AND
							REESUS.TPN IN ('p', 'q')
						)
					)
				THEN 'ft'
				WHEN
					-- 1.  ГБУ города Москвы «ССиНМП им. А.С. Пучкова ДЗМ»:
					-- 1.1. Все вызовы маркируются F_TYPE = «fp»;
					-- 2. ГБУЗ «МНПЦ ДиК ДЗМ»:
					-- 2.2 «st» используется в соответствии с общими правилами;
					-- 3. ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ»:
					-- 3.2 «st» не используется;
					S.LPU_ID NOT IN (4708)
					AND
					-- Значением «st» маркируются следующие медицинские услуги:
					-- 1.	медицинские стандарты и ВМП из справочника НСИ «reesms», а также услуги 99/199 разделов;
					-- 2.	услуги, оказанные госпитализированным пациентам МО (симультанные медицинские услуги, оплачиваемые в дополнение к МС, зарегистрированные на тот же номер истории болезни);
					-- 3.	услуги 56029/156003, выполненные в условиях круглосуточного стационара (2-3 разряд фасетного кода отделения соответствует значению USL_OK = 1 по справочнику НСИ «profotXX») за исключением услуг, выполненных в приёмном отделении (отделение с 2-3 символами фасетного кода «70» или «73»).
					-- 4.	услуги, оказанные в дополнение к услугам 56029/156003 (зарегистрированные на тот же номер истории болезни), за исключением услуг, выполненных в приёмном отделении (отделении с 2-3 символами фасетного кода «70» или «73»). 
					(
						S.LPU_ID != 1989
						OR
						(
							S.LPU_ID = 1989
							AND
							-- 3.2 «st» маркируются оказанные прикреплённым к другим МО пациентам, а также пациентам, не имеющим прикрепления по профилю «терапия/педиатрия» услуги:
							-- 3.2.1 медицинские стандарты и ВМП из справочника НСИ «reesms», а также услуги 99/199 разделов;
							-- 3.2.2 услуги, оказанные госпитализированным пациентам МО с ПФ больничного типа (симультанные медицинские услуги, оплачиваемые в дополнение к МС, ВМП, услугам 99/199 раздела, зарегистрированные на тот же номер истории болезни);
							-- 3.2.3 услуги 56029/156003, выполненные в условиях круглосуточного стационара (2-3 разряд фасетного кода отделения соответствует значению USL_OK = 1 по справочнику НСИ «profotXX») за исключением услуг, выполненных в приёмном отделении (отделение с 2-3 символами фасетного кода «70» или «73»);
							(
								(
									USVMP2.COD IS NULL
									AND
									SPRLPU_PRIK.CODE IS NOT NULL
									AND
									S.LPU_ID != SPRLPU_PRIK.CODE
								)
								OR
								(
									USVMP2.COD IS NOT NULL
									AND
									SPRLPU_PRIKS.CODE IS NOT NULL
									AND
									S.LPU_ID != SPRLPU_PRIKS.CODE
								)
								OR
								SPRLPU_PRIK.CODE IS NULL
							)
						)
					)
					AND
					(
						REESUS.COD IS NULL
						OR
						SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199')
						OR
						(
							REESUS.COD IS NOT NULL
							AND
							SUM(CASE WHEN REESUS.COD IS NULL OR SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
						)
						OR
						(
							S.COD IN (56029, 156003)
							AND
							PROFOT.USL_OK IN (1)
							AND
							SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73')
						)
						OR
						(
							REESUS.COD IS NOT NULL
							AND
							S.LPU_ID != 1989 -- дополнения для 1989 нет
							AND
							SUM(CASE WHEN S.COD IN (56029, 156003) AND PROFOT.USL_OK IN (1) AND SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
							AND
							SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73')
						)
					)
				THEN
					CASE
						WHEN
							SPRLPU_LPU.TPN IS NOT NULL
							AND
							SPRLPU_PRIK.CODE IS NOT NULL
							AND
							SPRLPU_PRIK.CODE = 1989
							AND
							SPRLPU_PRIK.CODE != S.LPU_ID
							AND
							(
								-- 1.7.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинская помощь, оказанная в условиях круглосуточного стационара и дневного стационара (для дневного стационара в рамках данного пункта рассматриваются только услуги раздела 97/197 с TPN = «r»), а также все симультанные медицинские услуги, оплачиваемые в дополнение указанным МС/услугам дневного стационара, зарегистрированные на тот же номер истории болезни, в иных МО, при условии, что МС или услуга в ДС не входит в Приложение № 20 к ТС;
								SUM(
									CASE
										WHEN
											(
												(
													PROFOT.USL_OK IN (1)
													AND
													SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73')
												)
												OR
												(
													PROFOT.USL_OK IN (2)
													AND
													SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197')
													AND
													REESUS.TPN = 'r'
												)
											)
											AND
											NOT (
												S.COD IN (61010, 61020, 61030, 61040, 61050, 61060, 61070, 61080, 61090, 61100, 61110, 61120, 61130, 61140, 61150, 61160, 61170, 61180, 61190, 61200, 61210, 61220, 61230, 61240, 61250, 61260, 61270, 61280, 61290, 61300, 61310, 61320, 61330, 61400, 61410, 61430
													, 64030, 64031, 64032, 64034, 64041, 64051, 64061, 64071, 64072, 64081, 64082, 64091, 64092, 64101, 64111, 64121, 64122, 64124, 64131, 64141, 64151, 64160, 67010, 67020, 67030, 67040, 67050, 67060, 67070, 67080, 67090, 67100, 67110, 67120, 67130, 67140
													, 67150, 67160, 67170, 67180, 67190, 67200, 67210, 67220, 67230, 68260, 70150, 70160, 70170, 73010, 73011, 73020, 73030, 73040, 73050, 73051, 73060, 73070, 73080, 73090, 73100, 73110, 73120, 73130, 73140, 73141, 73150, 73160, 73170, 73180, 77010, 77020
													, 77030, 77040, 77050, 77060, 77070, 77080, 77090, 77100, 77110, 77120, 77130, 77140, 77150, 77160, 77170, 77190, 77200, 77210, 77220, 77230, 77240, 77250, 77260, 80100, 80110, 80120, 80130, 80140, 81011, 81020, 81050, 81051, 81071, 81075, 81080, 81081
													, 81082, 81090, 81091, 81093, 81094, 86010, 86020, 86030, 86040, 86050, 86060, 86070, 86080, 86090, 90010, 90030, 90050, 90060, 90070, 90080, 90090, 90100, 90111, 90121, 90130, 90131, 90135, 90141, 90160, 90180, 90183, 90190, 90200, 90201, 90202, 90210
													, 90220, 90230, 90231, 90240, 90251, 90260, 90280, 90310, 90340, 90345, 90350, 90360, 90380, 90390, 90400, 90410, 90420, 90430, 90460, 90470, 90480, 90490, 90500, 90510, 90520, 92010, 92020, 92030, 92040, 97003, 97008, 97009, 97010, 97013, 97014, 97015
													, 97016, 97017, 97018, 97030, 97041, 97060, 97061, 97062, 97063, 97064, 97065, 97066, 97067, 97068, 97069, 97070, 97071, 97072, 97073, 97107, 97143, 97144, 97146, 97147, 97149, 97150, 97151, 97152, 97153, 97154, 97155, 97157, 97158
												)
												OR
												S.COD IN (161070, 161071, 161080
													, 161081, 161090, 161091, 161100, 161101, 161110, 161111, 161120, 161121, 161150, 161151, 161160, 161161, 161170, 161171, 161180, 161181, 161190, 161191, 161200, 161201, 161220, 161221, 161230, 161231, 161260, 161261, 161280, 161281, 161290, 161291, 161300
													, 161301, 161310, 161311, 161320, 161321, 161400, 161401, 161410, 161411, 161430, 161431, 163010, 163011, 163020, 163021, 163030, 163031, 163040, 163041, 163050, 163051, 163060, 163061, 163070, 163071, 163080, 163081, 163090, 163091, 163100, 163101, 163110
													, 163111, 163120, 163121, 163130, 163131, 164030, 164031, 164040, 164041, 164050, 164051, 164060, 164061, 164070, 164071, 164080, 164081, 164090, 164091, 164100, 164101, 164110, 164111, 164120, 164121, 164130, 164131, 164140, 164141, 164150, 164151, 164160
													, 164161, 164170, 164171, 164180, 164181, 164190, 164191, 166010, 166011, 166020, 166021, 166030, 166031, 166040, 166041, 166050, 166051, 166060, 166061, 166070, 166071, 166080, 166081, 166100, 166101, 166110, 166111, 166120, 166121, 166130, 166131, 166140
													, 166141, 166150, 166151, 166160, 166161, 166170, 166171, 166180, 166181, 166190, 166191, 166200, 166201, 166210, 166211, 166220, 166221, 166230, 166231, 166240, 166241, 167010, 167011, 167020, 167021, 167030, 167031, 167032, 167033, 167040, 167041, 167042
													, 167043, 167050, 167051, 167060, 167061, 167070, 167071, 167080, 167081, 167090, 167091, 167100, 167101, 167110, 167111, 167120, 167121, 167122, 167123, 167130, 167131, 167132, 167133, 167140, 167141, 167150, 167151, 167160, 167161, 167162, 167163, 167170
													, 167171, 167180, 167181, 167182, 167183, 167190, 167191, 167200, 167201, 167210, 167211, 167212, 167213, 167220, 167221, 167230, 167231, 168010, 168011, 168020, 168021, 168030, 168031, 168040, 168041, 168050, 168051, 168060, 168061, 168070, 168071, 168080
													, 168081, 168090, 168091, 168092, 168093, 168100, 168101, 168110, 168111, 168120, 168121, 168130, 168131, 168140, 168141, 168150, 168151, 168160, 168161, 168162, 168163, 168170, 168171, 168180, 168181, 168190, 168191, 168200, 168201, 168202, 168203, 168210
													, 168211, 168220, 168221, 168230, 168231, 168240, 168241, 168250, 168251, 168260, 169010, 169011, 169020, 169021, 169030, 169031, 169040, 169041, 169050, 169051, 169070, 169071, 169080, 169081, 169090, 169091, 169100, 169101, 169110, 169111, 170030, 170031
													, 170040, 170041, 170060, 170061, 170070, 170071, 170080, 170081, 170090, 170091, 170150, 170151, 170160, 170161, 170170, 170171, 171010, 171011, 171030, 171031, 171040, 171041, 171050, 171051, 171060, 171061, 171080, 171081, 171090, 171091, 171100, 171101
													, 172010, 172011, 172020, 172021, 172030, 172031, 172040, 172041, 172042, 172043, 172050, 172051, 172052, 172053, 172060, 172061, 172062, 172063, 172070, 172071, 172072, 172073, 172080, 172081, 172090, 172091, 172092, 172093, 172100, 172101, 172110, 172111
													, 172120, 172121, 172130, 172131, 172140, 172141, 172150, 172151, 172160, 172161, 172162, 172163, 172170, 172171, 172180, 172181, 172190, 172191, 172192, 172193, 172200, 172201, 172202, 172203, 172210, 172211, 172220, 172221, 172222, 172223, 172230, 172231
													, 172240, 172241, 172250, 172251, 172260, 172261, 172270, 172271, 172280, 172281, 172290, 172291, 172300, 172301, 172310, 172311, 172320, 172321, 172330, 172331, 172340, 172341, 172350, 172351, 172352, 172353, 172360, 172361, 172362, 172363, 172370, 172371
													, 172380, 172381, 173020, 173021, 173030, 173031, 173040, 173041, 173050, 173051, 173060, 173061, 173070, 173071, 173080, 173081, 173090, 173091, 173100, 173101, 173110, 173111, 173120, 173121, 173130, 173131, 173140, 173141, 173150, 173151, 173160, 173161
													, 173170, 173171, 173180, 173181, 173190, 173191, 173200, 173201, 173210, 173211, 173220, 173221, 173230, 173231, 174010, 174011, 174020, 174021, 174030, 174031, 174040, 174041, 174050, 174051, 174060, 174061, 174070, 174071, 174080, 174081, 174090, 174091
													, 174100, 174101, 174110, 174111, 175010, 175011, 175012, 175013, 175020, 175021, 175022, 175023, 175030, 175031, 175040, 175041, 175050, 175051, 175052, 175053, 175060, 175061, 175070, 175071, 175080, 175081, 175090, 175091, 175100, 175101, 175110, 175111
													, 175112, 175113, 176010, 176011, 176020, 176021, 176030, 176031, 176040, 176041, 176050, 176051, 176060, 176061, 176070, 176071, 176080, 176081, 176090, 176091, 176100, 176101, 176102, 176103, 176110, 176111, 176120, 176121, 176130, 176131, 176140, 176141
													, 176150, 176151, 177010, 177011, 177020, 177021, 177030, 177031, 177040, 177041, 177050, 177051, 177060, 177061, 177070, 177071, 177080, 177081, 177090, 177091, 177100, 177101, 177110, 177111, 177120, 177121, 177130, 177131, 177140, 177141, 177150, 177151
													, 177160, 177161, 177170, 177171, 177190, 177191, 177210, 177211, 177220, 177221, 177240, 177241, 177250, 177251, 178010, 178011, 178020, 178021, 178030, 178031, 178040, 178041, 178050, 178051, 178060, 178061, 178070, 178071, 178080, 178081, 179010, 179011
													, 179020, 179021, 179022, 179023, 179030, 179031, 179040, 179041, 179042, 179043, 179050, 179051, 179052, 179053, 179060, 179061, 179070, 179071, 179080, 179081, 179082, 179083, 179090, 179091, 179100, 179101, 179110, 179111, 179112, 179113, 179120, 179121
													, 179122, 179123, 179130, 179131, 179132, 179133, 179150, 179151, 179152, 179153, 179160, 179161, 179170, 179171, 179180, 179181, 179182, 179183, 179190, 179191, 179200, 179201, 179202, 179203, 179210, 179211, 179212, 179213, 179220, 179221, 179222, 179223
													, 179230, 179231, 179232, 179233, 179240, 179241, 179242, 179243, 179250, 179251, 179252, 179253, 179260, 179261, 179270, 179271, 179280, 179281, 179282, 179283, 179290, 179291, 179300, 179301, 179302, 179303, 179310, 179311, 179312, 179313, 179320, 179321
													, 179322, 179323, 179330, 179331, 179340, 179341, 179350, 179351, 179360, 179361, 179370, 179371, 179380, 179381, 179382, 179383, 179390, 179391, 179392, 179393, 179400, 179401, 179402, 179403, 179410, 179411, 179412, 179413, 179420, 179421, 179430, 179431
													, 179440, 179441, 179442, 179443, 179450, 179451, 179452, 179453, 179460, 179461, 179462, 179463, 179470, 179471, 179472, 179473, 179480, 179481, 179482, 179483, 179560, 180010, 180020, 180030, 182010, 182011, 182020, 182021, 182030, 182031, 183010, 183011
													, 183020, 183021, 183022, 183023, 183030, 183031, 183040, 183041, 183050, 183051, 183060, 183061, 183070, 183071, 183080, 183081, 183090, 183091, 183100, 183101, 183110, 183111, 183120, 183121, 183130, 183131, 183140, 183141, 183150, 183151, 183160, 183161
													, 183170, 183171, 184020, 184021, 184030, 184031, 185010, 185011, 185020, 185021, 185022, 185023, 185030, 185031, 185040, 185041, 185050, 185051, 185060, 185061, 185062, 185063, 185070, 185071, 185072, 185073, 185080, 185081, 185082, 185083, 185090, 185091
													, 185092, 185093, 185100, 185101, 185102, 185103, 185110, 185111, 185112, 185113, 186010, 186011, 186020, 186021, 186030, 186031, 186040, 186041, 190010, 190011, 190020, 190021, 190030, 190031, 190040, 190041, 190050, 190051, 190060, 190061, 190070, 190071
													, 190080, 190081, 190090, 190091, 190100, 190101, 190110, 190111, 190120, 190121, 190130, 190131, 190140, 190141, 190150, 190151, 190160, 190161, 190170, 190171, 190180, 190181, 190190, 190191, 190200, 190201, 190210, 190211, 190220, 190221, 190230, 190231
													, 190240, 190241, 190250, 190251, 190260, 190261, 190280, 190281, 190290, 190291, 190300, 190301, 190310, 190311, 190320, 190321, 190330, 190331, 190340, 190341, 190350, 190351, 190360, 190361, 190370, 190371, 190380, 190381, 190390, 190391, 190400, 190401
													, 190410, 190411, 190420, 190421, 190430, 190431, 190440, 190441, 190450, 190451, 190460, 190461, 190480, 190481, 190482, 190483, 190490, 190491, 190500, 190501, 190510, 190511, 190520, 190521, 190530, 190531, 191010, 191020, 192010, 192011, 192020, 192021
													, 192030, 192031, 192040, 192041, 197001, 197002, 197003, 197010, 197011, 197013, 197014, 197015, 197016, 197020, 197021, 197022, 197023, 197024, 197025, 197026, 197027, 197028, 197029
												)
												OR
												S.COD IN (200040, 200041, 200042, 200043, 200044, 200045, 200046, 200047, 200048
													, 200049, 200050, 200051, 200052, 200053, 200054, 200055, 200056, 200057, 200105, 200106, 200107, 200108, 200109, 200110, 200111, 200112, 200113, 200114, 200115, 200116, 200117, 200118, 200119, 200120, 200121, 200122, 200123, 200124, 200125, 200126, 200127
													, 200128, 200129, 200130, 200131, 200132, 200133, 200134, 200135, 200136, 200137, 200138, 200139, 200140, 200141, 200142, 200143, 200144, 200145, 200146, 200147, 200148, 200149, 200150, 200151, 200152, 200153, 200154, 200155, 200156, 200157, 200158, 200159
													, 200160, 200161, 200162, 200163, 200164, 200165, 200166, 200167, 200168, 200169, 200170, 200171, 200172, 200173, 200174, 200175, 200176, 200177, 200178, 200179, 200180, 200181, 200182, 200183, 200184, 200185, 200186, 200187, 200188, 200189, 200190, 200191
													, 200192, 200193, 200194, 200195, 200196, 200197, 200198, 200199, 200200, 200201, 200202, 200203, 200204, 200205, 200206, 200207, 200208, 200209, 200210, 200211, 200212, 200213, 200214, 200215, 200216, 200217, 200218, 200219, 200220, 200221, 200222, 200223
													, 200224, 200225, 200226, 200227, 200228, 200229, 200230, 200231, 200232, 200233, 200234, 200235, 200236, 200237, 200238, 200239, 200240, 200241, 200242, 200243, 200244, 200245, 200246, 200247, 200248, 200249, 200250, 200251, 200252, 200253, 200254, 200255
													, 200256, 200257, 200258, 200259, 200260, 200261, 200262, 200263, 200264, 200265, 200266, 200267, 200268, 200269, 200270, 200271, 200272, 200273, 200274, 200275, 200276, 200277, 200278, 200279, 200280, 200281, 200282, 200283, 200284, 200285, 200286, 200287
													, 200288, 200289, 200290, 200291, 200292, 200293, 200294, 200295, 200296, 200297, 200298, 200299, 200300, 200301, 200302, 200303, 200304, 200305, 200306, 200307, 200308, 200309, 200310, 200311, 200312, 200314, 200315, 200316, 200317, 200318, 200319, 200320
													, 200321, 200322, 200323, 200324, 200325, 200326, 200327, 200328, 200329, 200330, 200331, 200332, 200333, 200334, 200335, 200336, 200337, 200338, 200339, 200340, 200341, 200342, 200343, 200344, 200345, 200346, 200347, 200348, 200349, 200350, 200351, 200353
													, 200354, 200355, 200356, 200357, 200358, 200359, 200360, 200361, 200362, 200363, 200364, 200365, 200366, 200367, 200368, 200369, 200370, 200371, 200372, 200373, 200374, 200375, 200376, 200377, 200378, 200379, 200380, 200381, 200382, 200383, 200385, 200386
													, 200387, 200388, 200389, 200390, 200391, 200392, 200393, 200394, 200395, 200396, 200397, 200398, 200399, 200400, 200401, 200402, 200403, 200404, 200405, 200411, 200412, 200413, 200414, 200440, 200441, 200442, 200443, 200444, 200445, 200446, 200447, 200448
													, 200449, 200450, 200454, 200477, 200478, 200481, 200482, 200483, 200484, 200485, 200486, 200487, 200488, 200489, 200490, 200509, 200514, 200515, 200539, 200540, 200541, 200542, 200543, 200544, 200545, 200546, 200547, 200548, 200549, 200550, 200551, 200552
													, 200553, 200554, 200555, 200556, 200557, 200558, 200559, 200560, 297356, 297542, 297543, 297544, 297545, 297546, 297547, 297548, 297549, 297550, 297551, 297552, 297553, 297554, 297555, 297556, 297557, 297558, 297559
												)
											)
										THEN 1
										ELSE 0
									END
								) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
								OR
								-- 1.8.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные в приемных отделениях (услуги, оказанные в отделении с 2-3 символами фасетного кода «70» или «73», за исключением МС разделов 84/184) иных МО;
								(
									SUBSTR(S.IOTD, 2, 2) IN ('70', '73')
									AND
									SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) NOT IN ('084', '184')
								)
								OR
								-- 1.9.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные «выездной бригадой» (услуги, оказанные в отделении с 2-3 символами фасетного кода «93», или имеющие код D_TYPE = «w») иных МО;
								-- 1.10.	Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные в женских консультациях (услуги, оказанные в отделении с 2-3 символами фасетного кода «08») иных МО;
								(
									SUBSTR(S.IOTD, 2, 2) IN ('93', '08')
									OR
									S.D_TYPE = 'w'
								)
								OR
								-- 1.11.	Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги по компьютерной томографии с кодами «37043», «137043», оказанные в связи с ОРВИ (диагноз из рубрики «J02», «J04», «J06»), гриппом (диагноз из рубрики «J09»-«J11»), пневмонией (диагноз из рубрики «J12»-«J18»), бронхитом (диагноз из рубрики «J20»), или коронавирусной инфекцией типа 2019-nCoV (диагноз «B34.2», «U07.1», «U07.2») в иных МО;
								(
									S.COD IN (37043, 137043)
									AND
									SUBSTR(S.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
								)
							)
						THEN 'vz'
						ELSE 'st'
					END
				WHEN
					-- 1. ГБУ города Москвы «ССиНМП им. А.С. Пучкова ДЗМ»:
					-- 1.1. Все вызовы маркируются F_TYPE = «fp»;
					-- 2. ГБУЗ «МНПЦ ДиК ДЗМ»:
					-- 2.2 «fh» - услуги 28212/128212, 28165/128165, оказанные по направлению от иных МО;
					-- 3. ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ»:
					-- 3.3 «fh» используется в соответствии с общими правилами;
					(
						S.LPU_ID IN (4963)
						AND
						S.COD IN (28212, 128212, 28165, 128165)
						AND
						S.LPU_ORD IS NOT NULL
						AND
						SPRLPU_ORD.CODE != S.LPU_ID
					)
					OR
					(
						S.LPU_ID NOT IN (4708, 4963)
						AND
						(
							(
								(
									-- 1.3.1	для лиц, прикреплённых по профилю «терапия»/«педиатрия» к другим МО, а также неприкреплённым пациентам, в соответствии с общими правилами;
									(
										S.LPU_ID = 1989
										AND
										(
											SPRLPU_PRIK.CODE != 1989
											OR
											SPRLPU_PRIK.CODE IS NULL
										)
									)
									OR
									S.LPU_ID != 1989
								)
								AND
								-- Значением «fh» маркируются следующие медицинские услуги:
								(
									-- 1.	услуги, исключенные из подушевого финансирования (услуги, имеющие значение TPN = «r» по справочнику НСИ «reesusXX»);
									REESUS.TPN = 'r'
									OR
									-- 2.	услуги отделения патанатомии (услуги разделов 59/159, 29/129, выполненные в отделении с 2-3 символами фасентного кода отделения «85») за исключением оформленных как симультанные;
									(
										SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('059', '159', '029', '129')
										AND
										SUBSTR(S.IOTD, 2, 2) = '85'
										AND
										SUM(CASE WHEN REESUS.COD IS NULL OR SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) = 0
									)
									OR
									-- 3.	услуги, оказанные в приемном отделении (услуги, оказанные в отделении с 2-3 символами фасетного кода «70» или «73», за исключением МС разделов 84/184);
									(
										(
											SUBSTR(S.IOTD, 2, 2) IN ('70', '73')
											AND
											SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) NOT IN ('084', '184')
										)
									)
									OR
									-- 4.	услуги, оказанные «выездной бригадой» МО (услуги, оказанные в отделении с 2-3 символами фасетного кода «93», или имеющие код D_TYPE = «w»);
									(
										(
											S.D_TYPE = 'w'
											OR
											SUBSTR(S.IOTD, 2, 2) = '93'
										)
									)
									OR
									-- 5.	услуги, оказанные в женских консультациях (услуги, оказанные в отделении с 2-3 символами фасетного кода «08»);
									SUBSTR(S.IOTD, 2, 2) = '08'
									OR
									-- 6.	услуги 37043, 37048, 137043, 37044, 37049, 137044, 137049, выполненных по направлению врача-онколога (данные о специальности направившего врача в ИС ПУМП. Коды специальности врача: 17, 41, 73, 82);
									(
										S.COD IN (37043, 37048, 137043, 37044, 37049, 137044, 137049)
										AND
										MC.DIRECTION_DOCTOR_SPEC IN (17, 41, 73, 82)
									)
									OR
									-- 7.	медицинские услуги по компьютерной томографии с кодами «37043», «137043», оказанные в связи с ОРВИ (диагноз из рубрики «J02», «J04», «J06»), гриппом (диагноз из рубрики «J09»-«J11»), пневмонией (диагноз из рубрики «J12»-«J18»), бронхитом (диагноз из рубрики «J20»), или коронавирусной инфекцией типа 2019-nCoV (диагноз «B34.2», «U07.1», «U07.2»);
									(
										S.COD IN (37043, 137043)
										AND
										(
											SUBSTR(S.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
											OR
											S.DS IN ('B34.2', 'U07.1', 'U07.2')
										)
									)
									OR
									-- 8.	услуги 28165, 128165, оказанных в медицинских организациях, включенных в справочник НСИ АИС ОМС «sprncoXX» и имеющих значение параметра «IG» = «1», не ранее даты, указанной в параметре «DATEBEG_4» и не позднее даты, указанной в параметре «DATEEND_4», в случае направления от МО, имеющей значение параметра TPN по справочнику НСИ «sprlpuXX», равное «1»/«2»/«3»;
									(
										S.COD IN (28165, 128165)
										AND
										SPRNCO.CODE IS NOT NULL
										AND
										SPRNCO.IG = 1 AND TRUNC(S.D_U, 'DD') >= SPRNCO.DATEBEG_4 AND TRUNC(S.D_U, 'DD') <= SPRNCO.DATEEND_4
										AND
										SPRLPU_ORD.TPN IS NOT NULL
										AND
										SPRLPU_ORD.TPN IN (1, 2, 3)
									)
									OR
									-- 9.	медицинские услуги, имеющие по справочнику НСИ USVMP сочетание VMP = 11/13 И VMP146 = 2, оказанные в МО: 4734 (ЦНИИ СЧЛХ), 2321 (Первый МГМУ Сеченова), 4733 (МГМСУ Евдокимова), 4996 (НМИЦ Гематологии), 4698 (РНИМУ Пирогова), в клинико-диагностическом отделении (отделении с 2-3 символами фасетного кода «01»), или в рамках проведения УМО (услуги, имеющие ORD = 7 или номер медицинской карты (C_I) начинается с аббревиатуры «УМО»), а также услуги, оказанные пациентам, не имеющим прикрепления по профилю «стоматология».
										S.LPU_ID IN (4734, 2321, 4733, 4996, 4698)
										AND
										-- SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('009', '109')
										-- AND
										USVMP2.COD IS NOT NULL -- то же что и VMP146 = 2
										AND
										USVMP2.VMP IN (11, 13)
										AND
										(
											SUBSTR(S.IOTD, 2, 2) IN ('01')
											OR
											S.ORD = 7
											OR
											SUBSTR(S.C_I, 1, 3) = 'УМО'
											OR
											SPRLPU_PRIKS.CODE IS NULL
										)
									OR
									-- 10.	для прикрепленных к другим МО, а также неприкреплённых к медицинским организациям по профилю «терапия/педиатрия» – услуги, оказанные в клинико-диагностических отделениях данного МО (услуги, оказанные в отделении с 2-3 символами фасетного кода «01»);
									(
										(
											(
												USVMP2.COD IS NULL
												AND
												SPRLPU_PRIK.CODE IS NOT NULL
												AND
												S.LPU_ID != SPRLPU_PRIK.CODE
											)
											OR
											(
												USVMP2.COD IS NOT NULL
												AND
												SPRLPU_PRIKS.CODE IS NOT NULL
												AND
												S.LPU_ID != SPRLPU_PRIKS.CODE
											)
											OR
											SPRLPU_PRIK.CODE IS NULL
										)
										AND
										SUBSTR(S.IOTD, 2, 2) IN ('01')
									)
									OR
									-- 11.	для прикрепленных к другим МО, а также неприкреплённых к медицинским организациям по профилю «терапия/педиатрия» – услуги, оказанные в рамках проведения углубленных медицинских осмотров лиц младше 18 лет (в соответствии с приказом Минздравсоцразвития РФ от 01.03.2016 № 134н), обучающихся в учреждениях, подведомственных Департаменту физической культуры и спорта города Москвы (Москомспорта) (услуги, имеющие ORD = 7 или номер медицинской карты (C_I) начинается с аббревиатуры «УМО»).
									(
										(
											(
												USVMP2.COD IS NULL
												AND
												SPRLPU_PRIK.CODE IS NOT NULL
												AND
												S.LPU_ID != SPRLPU_PRIK.CODE
											)
											OR
											(
												USVMP2.COD IS NOT NULL
												AND
												SPRLPU_PRIKS.CODE IS NOT NULL
												AND
												S.LPU_ID != SPRLPU_PRIKS.CODE
											)
											OR
											SPRLPU_PRIK.CODE IS NULL
										)
										AND
										(
											S.ORD = 7
											OR
											SUBSTR(S.C_I, 1, 3) = 'УМО'
										)
									)
									OR
									-- 12.	медицинские услуги, оказанные госпитализированным в дневной стационар пациентам МО (симультанные медицинские услуги, оплачиваемые в дополнение к услугам 97/197 раздела, за исключением услуг 97/197 раздела, имеющим значение TPN = p, зарегистрированные на тот же номер истории болезни);
									(
										REESUS.COD IS NOT NULL
										AND
										SUM(CASE WHEN REESUS.COD IS NOT NULL AND SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
										AND
										NOT (
											SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197')
											AND
											REESUS.TPN = 'p'
										)
									)
								)
							)
							OR
							(
								-- 1.3.2	для лиц, прикреплённых по профилю «терапия»/«педиатрия» к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», «fh» применяется для:
								(
									S.LPU_ID = 1989
									AND
									SPRLPU_PRIK.CODE IS NOT NULL
									AND
									SPRLPU_PRIK.CODE = 1989
								)
								AND
								(
									-- 1.3.2.1	услуги отделения патанатомии (услуги разделов 59/159, 29/129, выполненные в отделении с 2-3 символами фасентного кода отделения «85») за исключением оформленных как симультанные;
									(
										SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('059', '159', '029', '129')
										AND
										SUBSTR(S.IOTD, 2, 2) = '85'
										AND
										SUM(CASE WHEN REESUS.COD IS NULL OR SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) = 0
									)
									OR
									-- 1.3.2.2	услуги 37043, 37048, 137043, 37044, 37049, 137044, 137049, выполненных по направлению врача-онколога (данные о специальности направившего врача в ИС ПУМП. Коды специальности врача: 17, 41, 73, 82);
									(
										S.COD IN (37043, 37048, 137043, 37044, 37049, 137044, 137049)
										AND
										MC.DIRECTION_DOCTOR_SPEC IN (17, 41, 73, 82)
									)
									OR
									-- 1.3.2.3	услуги 28165, 128165, в случае направления от МО, имеющей значение параметра TPN по справочнику НСИ «sprlpuXX», равное «1»/«2»/«3»;
									(
										S.COD IN (28165, 128165)
										AND
										SPRLPU_ORD.TPN IS NOT NULL
										AND
										SPRLPU_ORD.TPN IN (1, 2, 3)
									)
									OR
									-- 1.3.2.4	услуги, исключенные из подушевого финансирования (услуги, имеющие значение TPN = «r» по справочнику НСИ «reesusXX»);
									(
										REESUS.TPN = 'r'
									)
									OR
									-- 1.3.2.5	медицинские услуги по компьютерной томографии с кодами «37043», «137043», оказанные в связи с коронавирусной инфекцией типа 2019-nCoV (диагноз «B34.2», «U07.1», «U07.2»);
									(
										S.COD IN (37043, 137043)
										AND
										S.DS IN ('B34.2', 'U07.1', 'U07.2')
									)
								)
							)
						)
					)
				THEN 'fh'
				WHEN
					-- 1. ГБУ города Москвы «ССиНМП им. А.С. Пучкова ДЗМ»:
					-- 1.1. Все вызовы маркируются F_TYPE = «fp»;
					-- 2. ГБУЗ «МНПЦ ДиК ДЗМ»:
					-- 2.3 «vz» не используется;
					-- 3. ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ»:
					-- 3.4 «vz» используется в соответствии с общими правилами;
					S.LPU_ID NOT IN (4708, 4963)
					AND
					SPRLPU_LPU.TPN IN (1, 2, 3, 4)
					AND
					(
						-- Значением «vz» маркируются следующие медицинские услуги:
						-- 1.	В случае окзания ПСМП по профилю «терапия»/«педиатрия»:
						-- 2.	В случае окзания ПСМП по профилю «стоматология» не используется.
						(
							USVMP2.COD IS NULL
							AND
							REESUS.TPN IN ('p', 'q')
							AND
							SPRLPU_LPU.TPN IS NOT NULL
							AND
							SPRLPU_PRIK.CODE IS NOT NULL
							AND
							S.LPU_ID != SPRLPU_PRIK.CODE
							AND
							(
								-- 1.1.	медицинские услуги, имеющие значение TPN = «p», оказанные по направлению в медицинских организациях (направившая МО может не являться МО прикрепления, но должна отличаться от МО оказания медицинской помощи), имеющих значение TPN = «1» / «2» / «3» / «4», пациентам, прикреплённым к иным медицинским организациям.
								(
									REESUS.TPN IN ('p')
									AND
									S.ORD IS NOT NULL
									AND
									S.LPU_ORD IS NOT NULL
									AND
									S.DATE_ORD IS NOT NULL
									AND
									SPRLPU_ORD.CODE != S.LPU_ID
								)
								OR
								-- 1.2.	медицинские услуги, имеющие значение TPN = «q», оказанные независимо от наличия направления в медицинских организациях, имеющих значение TPN = «1» / «2» / «3» / «4», пациентам, прикреплённым к иным медицинским организациям.
								(
									REESUS.TPN IN ('q')
								)
								OR
								-- 1.3.	медицинские услуги, оказанные лицам, прикрепившимся к другим МО, по направлению, включая "актив" бригады ССиНМП (LPU_ORD = «4708»/«774708»);
								(
									S.LPU_ORD IN ('4708', '774708')
								)
								OR
								-- 1.3.	медицинские услуги, оказанные в отделениях профилактики ДШО/ШО по договору МО прикрепления с учреждениями ДШО/ШО, а также услуги вакцинопрофилактики, оказанные по договору МО прикрепления с учреждением-исполнителем (ORD = 8);
								(
									S.ORD = 8
								)
								OR
								-- 1.4.	медицинские услуги по профилю «травматология и ортопедия», оказанные в травмпунктах (услуги, оказанные в отделении 2-3 символами фасетного кода «92»);
								-- 1.5.	комплексное обследование в центре здоровья и последующие медицинские услуги, оказанные пациентам, зарегистрированным в центре здоровья (услуги, оказанные в отделении 2-3 символами фасетного кода «91»);
								(
									SUBSTR(S.IOTD, 2, 2) IN ('91', '92')
								)
								-- OR
								-- 1.7.	медицинские услуги из группы "неотложная медицинская помощь", оказанные лицам, прикрепившимся к другим МО (справочник НСИ «REESUSxx», параметр «TPN» = «q»);
								-- см. 1.2
								-- 1.8.	медицинская помощь в дневном стационаре, кроме услуг, исключенных из подушевого финансирования, оказанная лицам, прикрепившимся к другим МО, по направлению (услуги разделов 97/197, имеющие значение TPN = «p»);
								-- (
								-- 	REESUS.TPN IN ('p')
								-- 	AND
								-- 	SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197')
								-- )
								OR
								-- 1.6.	 медицинские услуги, оказанные прикреплённым к другим МО по направлению военкомата (LPU_ORD = 5650);
								(
									S.LPU_ORD = '5650'
								)
							)
						)
						OR
						-- 1.7.	В дополнение, для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», получивших медицинскую помощь в условиях круглосуточного стационара в иных МО
						-- , при условии, что МС не входит в Приложение № 20 к ТС, такие МС также маркируются «vz» и оплачиваются из средств ПФ ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ».
						(
							SPRLPU_LPU.TPN IS NOT NULL
							AND
							SPRLPU_PRIK.CODE IS NOT NULL
							AND
							SPRLPU_PRIK.CODE = 1989
							AND
							SPRLPU_PRIK.CODE != S.LPU_ID
							AND
							(
								-- 1.7.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинская помощь, оказанная в условиях круглосуточного стационара и дневного стационара (для дневного стационара в рамках данного пункта рассматриваются только услуги раздела 97/197 с TPN = «r»), а также все симультанные медицинские услуги, оплачиваемые в дополнение указанным МС/услугам дневного стационара, зарегистрированные на тот же номер истории болезни, в иных МО, при условии, что МС или услуга в ДС не входит в Приложение № 20 к ТС;
								SUM(
									CASE
										WHEN
											(
												(
													PROFOT.USL_OK IN (1)
													AND
													SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73')
												)
												OR
												(
													PROFOT.USL_OK IN (2)
													AND
													SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197')
													AND
													REESUS.TPN = 'r'
												)
											)
											AND
											NOT (
												S.COD IN (61010, 61020, 61030, 61040, 61050, 61060, 61070, 61080, 61090, 61100, 61110, 61120, 61130, 61140, 61150, 61160, 61170, 61180, 61190, 61200, 61210, 61220, 61230, 61240, 61250, 61260, 61270, 61280, 61290, 61300, 61310, 61320, 61330, 61400, 61410, 61430
													, 64030, 64031, 64032, 64034, 64041, 64051, 64061, 64071, 64072, 64081, 64082, 64091, 64092, 64101, 64111, 64121, 64122, 64124, 64131, 64141, 64151, 64160, 67010, 67020, 67030, 67040, 67050, 67060, 67070, 67080, 67090, 67100, 67110, 67120, 67130, 67140
													, 67150, 67160, 67170, 67180, 67190, 67200, 67210, 67220, 67230, 68260, 70150, 70160, 70170, 73010, 73011, 73020, 73030, 73040, 73050, 73051, 73060, 73070, 73080, 73090, 73100, 73110, 73120, 73130, 73140, 73141, 73150, 73160, 73170, 73180, 77010, 77020
													, 77030, 77040, 77050, 77060, 77070, 77080, 77090, 77100, 77110, 77120, 77130, 77140, 77150, 77160, 77170, 77190, 77200, 77210, 77220, 77230, 77240, 77250, 77260, 80100, 80110, 80120, 80130, 80140, 81011, 81020, 81050, 81051, 81071, 81075, 81080, 81081
													, 81082, 81090, 81091, 81093, 81094, 86010, 86020, 86030, 86040, 86050, 86060, 86070, 86080, 86090, 90010, 90030, 90050, 90060, 90070, 90080, 90090, 90100, 90111, 90121, 90130, 90131, 90135, 90141, 90160, 90180, 90183, 90190, 90200, 90201, 90202, 90210
													, 90220, 90230, 90231, 90240, 90251, 90260, 90280, 90310, 90340, 90345, 90350, 90360, 90380, 90390, 90400, 90410, 90420, 90430, 90460, 90470, 90480, 90490, 90500, 90510, 90520, 92010, 92020, 92030, 92040, 97003, 97008, 97009, 97010, 97013, 97014, 97015
													, 97016, 97017, 97018, 97030, 97041, 97060, 97061, 97062, 97063, 97064, 97065, 97066, 97067, 97068, 97069, 97070, 97071, 97072, 97073, 97107, 97143, 97144, 97146, 97147, 97149, 97150, 97151, 97152, 97153, 97154, 97155, 97157, 97158
												)
												OR
												S.COD IN (161070, 161071, 161080
													, 161081, 161090, 161091, 161100, 161101, 161110, 161111, 161120, 161121, 161150, 161151, 161160, 161161, 161170, 161171, 161180, 161181, 161190, 161191, 161200, 161201, 161220, 161221, 161230, 161231, 161260, 161261, 161280, 161281, 161290, 161291, 161300
													, 161301, 161310, 161311, 161320, 161321, 161400, 161401, 161410, 161411, 161430, 161431, 163010, 163011, 163020, 163021, 163030, 163031, 163040, 163041, 163050, 163051, 163060, 163061, 163070, 163071, 163080, 163081, 163090, 163091, 163100, 163101, 163110
													, 163111, 163120, 163121, 163130, 163131, 164030, 164031, 164040, 164041, 164050, 164051, 164060, 164061, 164070, 164071, 164080, 164081, 164090, 164091, 164100, 164101, 164110, 164111, 164120, 164121, 164130, 164131, 164140, 164141, 164150, 164151, 164160
													, 164161, 164170, 164171, 164180, 164181, 164190, 164191, 166010, 166011, 166020, 166021, 166030, 166031, 166040, 166041, 166050, 166051, 166060, 166061, 166070, 166071, 166080, 166081, 166100, 166101, 166110, 166111, 166120, 166121, 166130, 166131, 166140
													, 166141, 166150, 166151, 166160, 166161, 166170, 166171, 166180, 166181, 166190, 166191, 166200, 166201, 166210, 166211, 166220, 166221, 166230, 166231, 166240, 166241, 167010, 167011, 167020, 167021, 167030, 167031, 167032, 167033, 167040, 167041, 167042
													, 167043, 167050, 167051, 167060, 167061, 167070, 167071, 167080, 167081, 167090, 167091, 167100, 167101, 167110, 167111, 167120, 167121, 167122, 167123, 167130, 167131, 167132, 167133, 167140, 167141, 167150, 167151, 167160, 167161, 167162, 167163, 167170
													, 167171, 167180, 167181, 167182, 167183, 167190, 167191, 167200, 167201, 167210, 167211, 167212, 167213, 167220, 167221, 167230, 167231, 168010, 168011, 168020, 168021, 168030, 168031, 168040, 168041, 168050, 168051, 168060, 168061, 168070, 168071, 168080
													, 168081, 168090, 168091, 168092, 168093, 168100, 168101, 168110, 168111, 168120, 168121, 168130, 168131, 168140, 168141, 168150, 168151, 168160, 168161, 168162, 168163, 168170, 168171, 168180, 168181, 168190, 168191, 168200, 168201, 168202, 168203, 168210
													, 168211, 168220, 168221, 168230, 168231, 168240, 168241, 168250, 168251, 168260, 169010, 169011, 169020, 169021, 169030, 169031, 169040, 169041, 169050, 169051, 169070, 169071, 169080, 169081, 169090, 169091, 169100, 169101, 169110, 169111, 170030, 170031
													, 170040, 170041, 170060, 170061, 170070, 170071, 170080, 170081, 170090, 170091, 170150, 170151, 170160, 170161, 170170, 170171, 171010, 171011, 171030, 171031, 171040, 171041, 171050, 171051, 171060, 171061, 171080, 171081, 171090, 171091, 171100, 171101
													, 172010, 172011, 172020, 172021, 172030, 172031, 172040, 172041, 172042, 172043, 172050, 172051, 172052, 172053, 172060, 172061, 172062, 172063, 172070, 172071, 172072, 172073, 172080, 172081, 172090, 172091, 172092, 172093, 172100, 172101, 172110, 172111
													, 172120, 172121, 172130, 172131, 172140, 172141, 172150, 172151, 172160, 172161, 172162, 172163, 172170, 172171, 172180, 172181, 172190, 172191, 172192, 172193, 172200, 172201, 172202, 172203, 172210, 172211, 172220, 172221, 172222, 172223, 172230, 172231
													, 172240, 172241, 172250, 172251, 172260, 172261, 172270, 172271, 172280, 172281, 172290, 172291, 172300, 172301, 172310, 172311, 172320, 172321, 172330, 172331, 172340, 172341, 172350, 172351, 172352, 172353, 172360, 172361, 172362, 172363, 172370, 172371
													, 172380, 172381, 173020, 173021, 173030, 173031, 173040, 173041, 173050, 173051, 173060, 173061, 173070, 173071, 173080, 173081, 173090, 173091, 173100, 173101, 173110, 173111, 173120, 173121, 173130, 173131, 173140, 173141, 173150, 173151, 173160, 173161
													, 173170, 173171, 173180, 173181, 173190, 173191, 173200, 173201, 173210, 173211, 173220, 173221, 173230, 173231, 174010, 174011, 174020, 174021, 174030, 174031, 174040, 174041, 174050, 174051, 174060, 174061, 174070, 174071, 174080, 174081, 174090, 174091
													, 174100, 174101, 174110, 174111, 175010, 175011, 175012, 175013, 175020, 175021, 175022, 175023, 175030, 175031, 175040, 175041, 175050, 175051, 175052, 175053, 175060, 175061, 175070, 175071, 175080, 175081, 175090, 175091, 175100, 175101, 175110, 175111
													, 175112, 175113, 176010, 176011, 176020, 176021, 176030, 176031, 176040, 176041, 176050, 176051, 176060, 176061, 176070, 176071, 176080, 176081, 176090, 176091, 176100, 176101, 176102, 176103, 176110, 176111, 176120, 176121, 176130, 176131, 176140, 176141
													, 176150, 176151, 177010, 177011, 177020, 177021, 177030, 177031, 177040, 177041, 177050, 177051, 177060, 177061, 177070, 177071, 177080, 177081, 177090, 177091, 177100, 177101, 177110, 177111, 177120, 177121, 177130, 177131, 177140, 177141, 177150, 177151
													, 177160, 177161, 177170, 177171, 177190, 177191, 177210, 177211, 177220, 177221, 177240, 177241, 177250, 177251, 178010, 178011, 178020, 178021, 178030, 178031, 178040, 178041, 178050, 178051, 178060, 178061, 178070, 178071, 178080, 178081, 179010, 179011
													, 179020, 179021, 179022, 179023, 179030, 179031, 179040, 179041, 179042, 179043, 179050, 179051, 179052, 179053, 179060, 179061, 179070, 179071, 179080, 179081, 179082, 179083, 179090, 179091, 179100, 179101, 179110, 179111, 179112, 179113, 179120, 179121
													, 179122, 179123, 179130, 179131, 179132, 179133, 179150, 179151, 179152, 179153, 179160, 179161, 179170, 179171, 179180, 179181, 179182, 179183, 179190, 179191, 179200, 179201, 179202, 179203, 179210, 179211, 179212, 179213, 179220, 179221, 179222, 179223
													, 179230, 179231, 179232, 179233, 179240, 179241, 179242, 179243, 179250, 179251, 179252, 179253, 179260, 179261, 179270, 179271, 179280, 179281, 179282, 179283, 179290, 179291, 179300, 179301, 179302, 179303, 179310, 179311, 179312, 179313, 179320, 179321
													, 179322, 179323, 179330, 179331, 179340, 179341, 179350, 179351, 179360, 179361, 179370, 179371, 179380, 179381, 179382, 179383, 179390, 179391, 179392, 179393, 179400, 179401, 179402, 179403, 179410, 179411, 179412, 179413, 179420, 179421, 179430, 179431
													, 179440, 179441, 179442, 179443, 179450, 179451, 179452, 179453, 179460, 179461, 179462, 179463, 179470, 179471, 179472, 179473, 179480, 179481, 179482, 179483, 179560, 180010, 180020, 180030, 182010, 182011, 182020, 182021, 182030, 182031, 183010, 183011
													, 183020, 183021, 183022, 183023, 183030, 183031, 183040, 183041, 183050, 183051, 183060, 183061, 183070, 183071, 183080, 183081, 183090, 183091, 183100, 183101, 183110, 183111, 183120, 183121, 183130, 183131, 183140, 183141, 183150, 183151, 183160, 183161
													, 183170, 183171, 184020, 184021, 184030, 184031, 185010, 185011, 185020, 185021, 185022, 185023, 185030, 185031, 185040, 185041, 185050, 185051, 185060, 185061, 185062, 185063, 185070, 185071, 185072, 185073, 185080, 185081, 185082, 185083, 185090, 185091
													, 185092, 185093, 185100, 185101, 185102, 185103, 185110, 185111, 185112, 185113, 186010, 186011, 186020, 186021, 186030, 186031, 186040, 186041, 190010, 190011, 190020, 190021, 190030, 190031, 190040, 190041, 190050, 190051, 190060, 190061, 190070, 190071
													, 190080, 190081, 190090, 190091, 190100, 190101, 190110, 190111, 190120, 190121, 190130, 190131, 190140, 190141, 190150, 190151, 190160, 190161, 190170, 190171, 190180, 190181, 190190, 190191, 190200, 190201, 190210, 190211, 190220, 190221, 190230, 190231
													, 190240, 190241, 190250, 190251, 190260, 190261, 190280, 190281, 190290, 190291, 190300, 190301, 190310, 190311, 190320, 190321, 190330, 190331, 190340, 190341, 190350, 190351, 190360, 190361, 190370, 190371, 190380, 190381, 190390, 190391, 190400, 190401
													, 190410, 190411, 190420, 190421, 190430, 190431, 190440, 190441, 190450, 190451, 190460, 190461, 190480, 190481, 190482, 190483, 190490, 190491, 190500, 190501, 190510, 190511, 190520, 190521, 190530, 190531, 191010, 191020, 192010, 192011, 192020, 192021
													, 192030, 192031, 192040, 192041, 197001, 197002, 197003, 197010, 197011, 197013, 197014, 197015, 197016, 197020, 197021, 197022, 197023, 197024, 197025, 197026, 197027, 197028, 197029
												)
												OR
												S.COD IN (200040, 200041, 200042, 200043, 200044, 200045, 200046, 200047, 200048
													, 200049, 200050, 200051, 200052, 200053, 200054, 200055, 200056, 200057, 200105, 200106, 200107, 200108, 200109, 200110, 200111, 200112, 200113, 200114, 200115, 200116, 200117, 200118, 200119, 200120, 200121, 200122, 200123, 200124, 200125, 200126, 200127
													, 200128, 200129, 200130, 200131, 200132, 200133, 200134, 200135, 200136, 200137, 200138, 200139, 200140, 200141, 200142, 200143, 200144, 200145, 200146, 200147, 200148, 200149, 200150, 200151, 200152, 200153, 200154, 200155, 200156, 200157, 200158, 200159
													, 200160, 200161, 200162, 200163, 200164, 200165, 200166, 200167, 200168, 200169, 200170, 200171, 200172, 200173, 200174, 200175, 200176, 200177, 200178, 200179, 200180, 200181, 200182, 200183, 200184, 200185, 200186, 200187, 200188, 200189, 200190, 200191
													, 200192, 200193, 200194, 200195, 200196, 200197, 200198, 200199, 200200, 200201, 200202, 200203, 200204, 200205, 200206, 200207, 200208, 200209, 200210, 200211, 200212, 200213, 200214, 200215, 200216, 200217, 200218, 200219, 200220, 200221, 200222, 200223
													, 200224, 200225, 200226, 200227, 200228, 200229, 200230, 200231, 200232, 200233, 200234, 200235, 200236, 200237, 200238, 200239, 200240, 200241, 200242, 200243, 200244, 200245, 200246, 200247, 200248, 200249, 200250, 200251, 200252, 200253, 200254, 200255
													, 200256, 200257, 200258, 200259, 200260, 200261, 200262, 200263, 200264, 200265, 200266, 200267, 200268, 200269, 200270, 200271, 200272, 200273, 200274, 200275, 200276, 200277, 200278, 200279, 200280, 200281, 200282, 200283, 200284, 200285, 200286, 200287
													, 200288, 200289, 200290, 200291, 200292, 200293, 200294, 200295, 200296, 200297, 200298, 200299, 200300, 200301, 200302, 200303, 200304, 200305, 200306, 200307, 200308, 200309, 200310, 200311, 200312, 200314, 200315, 200316, 200317, 200318, 200319, 200320
													, 200321, 200322, 200323, 200324, 200325, 200326, 200327, 200328, 200329, 200330, 200331, 200332, 200333, 200334, 200335, 200336, 200337, 200338, 200339, 200340, 200341, 200342, 200343, 200344, 200345, 200346, 200347, 200348, 200349, 200350, 200351, 200353
													, 200354, 200355, 200356, 200357, 200358, 200359, 200360, 200361, 200362, 200363, 200364, 200365, 200366, 200367, 200368, 200369, 200370, 200371, 200372, 200373, 200374, 200375, 200376, 200377, 200378, 200379, 200380, 200381, 200382, 200383, 200385, 200386
													, 200387, 200388, 200389, 200390, 200391, 200392, 200393, 200394, 200395, 200396, 200397, 200398, 200399, 200400, 200401, 200402, 200403, 200404, 200405, 200411, 200412, 200413, 200414, 200440, 200441, 200442, 200443, 200444, 200445, 200446, 200447, 200448
													, 200449, 200450, 200454, 200477, 200478, 200481, 200482, 200483, 200484, 200485, 200486, 200487, 200488, 200489, 200490, 200509, 200514, 200515, 200539, 200540, 200541, 200542, 200543, 200544, 200545, 200546, 200547, 200548, 200549, 200550, 200551, 200552
													, 200553, 200554, 200555, 200556, 200557, 200558, 200559, 200560, 297356, 297542, 297543, 297544, 297545, 297546, 297547, 297548, 297549, 297550, 297551, 297552, 297553, 297554, 297555, 297556, 297557, 297558, 297559
												)
											)
										THEN 1
										ELSE 0
									END
								) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
								OR
								-- 1.8.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные в приемных отделениях (услуги, оказанные в отделении с 2-3 символами фасетного кода «70» или «73», за исключением МС разделов 84/184) иных МО;
								(
									SUBSTR(S.IOTD, 2, 2) IN ('70', '73')
									AND
									SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) NOT IN ('084', '184')
								)
								OR
								-- 1.9.		Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные «выездной бригадой» (услуги, оказанные в отделении с 2-3 символами фасетного кода «93», или имеющие код D_TYPE = «w») иных МО;
								-- 1.10.	Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги, оказанные в женских консультациях (услуги, оказанные в отделении с 2-3 символами фасетного кода «08») иных МО;
								(
									SUBSTR(S.IOTD, 2, 2) IN ('93', '08')
									OR
									S.D_TYPE = 'w'
								)
								OR
								-- 1.11.	Для пациентов, прикреплённых к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ», медицинские услуги по компьютерной томографии с кодами «37043», «137043», оказанные в связи с ОРВИ (диагноз из рубрики «J02», «J04», «J06»), гриппом (диагноз из рубрики «J09»-«J11»), пневмонией (диагноз из рубрики «J12»-«J18»), бронхитом (диагноз из рубрики «J20»), или коронавирусной инфекцией типа 2019-nCoV (диагноз «B34.2», «U07.1», «U07.2») в иных МО;
								(
									S.COD IN (37043, 137043)
									AND
									SUBSTR(S.DS, 1, 3) IN ('J02', 'J04', 'J06', 'J09', 'J10', 'J11', 'J12', 'J13', 'J14', 'J15', 'J16', 'J17', 'J18', 'J20')
								)
							)
						)
					)
				THEN 'vz'
				WHEN
					-- 1.  ГБУ города Москвы «ССиНМП им. А.С. Пучкова ДЗМ»:
 					-- 1.1. Все вызовы маркируются F_TYPE = «fp»;
					-- 2. ГБУЗ «МНПЦ ДиК ДЗМ»:
					-- 2.4 «fp» - все остальные услуги;
					-- 3. ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ»:
					-- 3.5 «fp» маркируются все остальные медицинские услуги, МС, ВМП, включая симультанные услуги, оказанные пациентам, прикреплённым к ГБУЗ «ГКБ им. М.П. Кончаловского ДЗМ».
					S.LPU_ID IN (4708, 4963)
					OR
					(
						S.LPU_ID IN (1989)
						AND
						SPRLPU_PRIK.CODE IS NOT NULL
						AND
						S.LPU_ID = SPRLPU_PRIK.CODE
					)
					OR
					(
						S.LPU_ID NOT IN (4708, 4963, 1989)
						AND
						(
							SPRLPU_LPU.TPN IN (1, 2, 3, 4)
							OR
							SPRLPU_LPU.TPNS IN (1, 2, 3, 4)
						)
						AND
						(
							-- Значением «fp» маркируются следующие медицинские услуги:
							(
								-- 1.	В случае окзания ПСМП по профилю «терапия»/«педиатрия»:
								-- 1.1.	все амбулаторно-поликлинические услуги, оказанные в данной МО прикрепленным к ней пациентам, включая услуги дневного стационара (все медицинские услуги, имеющие значение TPN = p/q), за исключением услуг, исключенных из ПФ (имеющих значение TPN = r), а также услуг, маркированных значением «fh» (дополнительные услуги МО);
								USVMP2.COD IS NULL
								AND
								REESUS.TPN IN ('p', 'q')
								AND
								SPRLPU_PRIK.CODE IS NOT NULL
								AND
								S.LPU_ID = SPRLPU_PRIK.CODE
							)
							OR
							(
								-- 2.	В случае окзания ПСМП по профилю «стоматология»:
								-- 2.1.	Все услуги, имеющие по справочнику НСИ USVMP сочетание VMP = 11/13 И VMP146 = 2, оказанные в данной МО прикрепленным к ней пациентам, за исключением услуг, маркированных значением «fh» (дополнительные услуги МО).
								-- 2.1.1.	Для МО, оказывающих ПСМП только по профилю «стоматология» (МО, имеющие значение параметра VMP = 1 и TPN = «пусто» и TPNS = 1/2/3/4), значением «fp» маркируются все медицинские услуги из справочника НСИ «reesus».
								USVMP2.COD IS NOT NULL
								AND
								(
									(
										-- SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('009', '109')
										-- AND
										USVMP2.COD IS NOT NULL -- то же что и VMP146 = 2
										AND
										USVMP2.VMP IN (11, 13)
										AND
										SPRLPU_PRIKS.CODE IS NOT NULL
										AND
										S.LPU_ID = SPRLPU_PRIKS.CODE
									)
									OR
									(
										SPRLPU_LPU.VMP = '1'
										AND
										SPRLPU_LPU.TPN IS NULL
										AND
										SPRLPU_LPU.TPNS IS NOT NULL
										AND
										REESUS.COD IS NOT NULL
									)
								)
							)
						)
					)
				THEN 'fp'
				WHEN
					-- 13.	все остальные амбулаторно-поликлинические медицинские услуги и услуги дневного стационара (раздел 97/197) , оказанные пациентам, прикреплённым к медицинским организациям по профилю «терапия/педиатрия», в МО, имеющих значение TPN = «пусто». Также, все остальные амбулаторно-поликлинические медицинские услуги, оказанные в условиях круглосуточного стационара (2-3 разряд фасетного кода отделения соответствует значению USL_OK = 1 по справочнику НСИ «profotXX») (за исключением приёмного отделения (пункт 2 описания алгоритма присвоения f_type «fh»), а также симультанных услуг (пункты 2 и 4 описания алгоритма присвоения f_type «st»).
					(
						REESUS.COD IS NOT NULL
						OR
						SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('097', '197')
					)
					AND
					(
						PROFOT.USL_OK != 1
						OR
						(
							PROFOT.USL_OK = 1
							AND
							NOT (
								-- п.3 fh
								(
									(
										SUBSTR(S.IOTD, 2, 2) IN ('70', '73')
										AND
										SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) NOT IN ('084', '184')
									)
								)
								OR
								-- п.2 st
								(
									REESUS.COD IS NOT NULL
									AND
									SUM(CASE WHEN REESUS.COD IS NULL OR SUBSTR(LPAD(S.COD, 6, '0'), 1, 3) IN ('099', '199') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
								)
								OR
								-- п.4 st
								(
									REESUS.COD IS NOT NULL
									AND
									S.LPU_ID != 1989 -- дополнения для 1989 нет
									AND
									SUM(CASE WHEN S.COD IN (56029, 156003) AND PROFOT.USL_OK IN (1) AND SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73') THEN 1 ELSE 0 END) OVER (PARTITION BY S.SN_POL, NVL(S.NOVOR, -1), S.C_I) != 0
									AND
									SUBSTR(S.IOTD, 2, 2) NOT IN ('70', '73')
								)
							)
						)
					)
					AND
					SPRLPU_PRIK.CODE IS NOT NULL
					AND
					SPRLPU_LPU.TPN IS NULL
				THEN 'fh'
			END F_TYPE2,s.f_type
		FROM PMP_PARCEL_S S
		JOIN PMP_PARCEL_R R ON
			S.PARCEL_ID = R.PARCEL_ID
			AND
			S.PERIOD = R.PERIOD
			AND
			S.LPU_ID = R.LPU_ID
			AND
			S.SN_POL = R.SN_POL
		LEFT JOIN PMP_MEDICAL_CASE MC ON
			S.PERIOD = MC.PERIOD
			AND
			S.LPU_ID = MC.MO_ID
			AND
			S.CASE_ID = MC.ID
		LEFT JOIN REESUS ON
			S.COD = REESUS.COD
		LEFT JOIN USVMP2 ON
			S.COD = USVMP2.COD
		LEFT JOIN SPRLPU SPRLPU_LPU ON
			S.LPU_ID = SPRLPU_LPU.FIL_ID
		LEFT JOIN SPRLPU SPRLPU_ORD ON
			(
				LENGTH(S.LPU_ORD) = 4
				OR
				(
					LENGTH(S.LPU_ORD) = 6
					AND
					SUBSTR(S.LPU_ORD, 1, 2) = '77'
				)
			)
			AND
			SUBSTR(S.LPU_ORD, -4, 4) = SPRLPU_ORD.FIL_ID
			AND
			S.D_U BETWEEN SPRLPU_ORD.START_DATE AND SPRLPU_ORD.END_DATE
		LEFT JOIN SPRLPU SPRLPU_PRIK ON
			R.PRIK = SPRLPU_PRIK.FIL_ID
		LEFT JOIN SPRLPU SPRLPU_PRIKS ON
			R.PRIKS = SPRLPU_PRIKS.FIL_ID
		LEFT JOIN PROFOT ON
			SUBSTR(S.IOTD, 2, 2) = PROFOT.CODE
		LEFT JOIN SPRNCO ON
			S.LPU_ID = SPRNCO.CODE
		WHERE
		S.PERIOD = :period
			AND S.LPU_ID = :lpuId
			AND S.PARCEL_ID = :parcelId
      )
      select * from t where F_TYPE != F_TYPE2 OR F_TYPE IS NULL OR F_TYPE2 IS NULL
